{
    "delete_server_confirm_description": "Questa azione non può essere annullata.",
    "prompt_confirm": "Conferma",
    "cancel": "Annulla",
    "save_changes": "Salva modifiche",
    "get_started": "Inizia",
    "prompt_done": "Fatto",
    "back": "Indietro",
    "help": "Aiuto",
    "setting_language": "Lingua",
    "help_us_translate": "Aiutaci a tradurre",
    "setting_background": "Continua ad eseguire in background dopo la chiusura",
    "setting_background_description": "Con questa opzione attivata, l'applicazione continuerà a eseguire i server web in background anche dopo la chiusura della finestra. Per arrestare il programma mentre questa opzione è attiva, fare clic sul pulsante \"Arresta e chiudi\".",
    "setting_tray": "Mostra un'icona nella barra delle notifiche/barra dei menu",
    "setting_tray_macos": "Mostra un'icona nella barra dei menu",
    "setting_tray_windows": "Mostra un'icona nella barra delle notifiche",
    "setting_tray_description": "Quando questa opzione è attivata, verrà aggiunta un'icona nell'area delle notifiche o nella barra dei menu quando Simple Web Server è in esecuzione.",
    "setting_updates": "Controlla gli aggiornamenti",
    "setting_updates_description": "Controlla regolarmente se è disponibile una nuova versione dell'applicazione. Gli aggiornamenti non verranno installati automaticamente.",
    "setting_theme": "Aspetto",
    "setting_theme_description": "Modifica l'aspetto (tema chiaro/scuro). Per impostazione predefinita, l'applicazione si adatta al tema del tuo sistema.",
    "setting_theme_system": "Automatico (Sistema)",
    "setting_theme_light": "Chiaro",
    "setting_theme_dark": "Scuro",
    "setting_plugins": "Plugin",
    "setting_plugins_description": "I plugin ti consentono di configurare i tuoi server web per andare oltre le opzioni disponibili nell'applicazione. <a href='https://simplewebserver.org/docs/plugins.html'>Scopri di più sui plugin.</a><br><br>Per installare un plugin, fai clic su \"Aggiungi plugin\" e seleziona una cartella o un file ZIP. Dopo aver installato un plugin, è necessario attivarlo per ogni server in cui si desidera utilizzarlo.<br><br>I plugin non sono isolati e funzionano con le stesse autorizzazioni dell'applicazione. Installa un plugin solo se conosci e ti fidi dello sviluppatore.",
    "add_plugin": "Aggiungi plugin",
    "plugin_choose_folder": "Seleziona una cartella",
    "plugin_choose_zip": "Seleziona un file .zip",
    "add_plugin_confirm": "Aggiungere il plugin \"[NAME]\"?",
    "add_plugin_confirm_description": "Installa questo plugin solo se ti fidi dello sviluppatore.<br><br>I plugin non sono isolati e funzionano con le stesse autorizzazioni dell'applicazione.",
    "add_plugin_failed": "Errore durante l'installazione del plugin",
    "add_plugin_invalid": "Plugin non valido",
    "add_plugin_failed_description": "File <code>plugin.json</code> non trovato nella cartella o nel file ZIP selezionato.",
    "remove_plugin": "Rimuovi plugin",
    "remove_plugin_confirm": "Rimuovere il plugin \"[NAME]\"?",
    "remove_plugin_confirm_description": "Tutte le impostazioni del server per questo plugin verranno eliminate. Se desideri aggiornare il plugin senza perdere le impostazioni del server, aggiungi semplicemente la nuova versione del plugin senza rimuoverlo.",
    "edit_server": "Modifica server",
    "add_server": "Aggiungi server",
    "create_server": "Crea server",
    "option_path_description": "Cartella in cui si trovano i file del server. Se la cartella si trova in una cartella nascosta, assicurati di attivare <a href='https://simplewebserver.org/docs/options.html#serve-hidden-dot-files'>Considera i file nascosti o che iniziano con un punto</a>.",
    "choose_folder": "Seleziona una cartella",
    "path_missing": "Scegliere il percorso di una cartella",
    "option_port_description": "Un numero compreso tra 1 e 65535. La porta su cui il server web locale sarà accessibile. Accedi al sito web con <code>http://localhost:[PORT]</code>.",
    "port_invalid": "Inserisci un numero compreso tra 1 e 65535",
    "port_in_use": "Questa porta è già in uso",
    "option_localnetwork_description": "Rende il server web accessibile dagli altri computer sulla rete LAN. Puoi accedervi da un altro computer utilizzando l'indirizzo IP locale del computer host e la porta specificata. L'indirizzo IP locale verrà visualizzato nell'URL dei server.<br><br>È necessario avere accesso alla rete locale per attivare questa opzione. Potrebbe essere necessario concedere un'autorizzazione per modificare il firewall quando si attiva questa opzione. Questa autorizzazione è necessaria se si desidera che il server web sia utilizzabile dalla LAN.",
    "option_localnetwork_abbreviation": "LAN",
    "option_showIndex_description": "Quando nessun percorso è specificato, invia <code>index.html</code> (se esiste).",
    "option_spa_description": "Riscrive automaticamente tutti i percorsi che non esistono su una singola pagina. Per le <a href='https://developer.mozilla.org/en-US/docs/Glossary/SPA'>Single Page Applications</a>.",
    "option_rewriteTo_description": "Se l'opzione per il reindirizzamento delle single page applications è attivata, specifica verso quale file devono essere reindirizzati i percorsi. Per le <a href='https://developer.mozilla.org/en-US/docs/Glossary/SPA'>Single Page Applications</a>.",
    "option_directoryListing_description": "Visualizza un elenco di file nella cartella specificata anziché un errore 404.",
    "option_excludeDotHtml_description": "Esclude le estensioni .htm e .html dagli URL. Ad esempio, <code>/example.html</code> sarà reindirizzato a <code>/example</code>. Se un file esiste in questo percorso, ma senza estensione, verrà visualizzato il file HTML al suo posto.",
    "option_ipv6_description": "Ascolta su IPV6 anziché sul valore predefinito, IPV4. Questo modificherà gli URL del server web in IPV6 anziché IPV4, ma gli indirizzi IPV4 potranno comunque funzionare quando la LAN è attiva.",
    "option_cacheControl_description": "Imposta un'intestazione HTTP <code>Cache-Control</code>. <a href='https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cache-Control'>Maggiori informazioni sugli header Cache-Control.</a>",
    "option_cors_description": "Autorizza le richieste da 'cross origin'. Imposta l'intestazione <code>Access-Control-Allow-Origin</code> su <code>*</code>, <code>Access-Control-Allow-Methods</code> su <code>GET, POST, PUT, DELETE</code>, e <code>Access-Control-Max-Age</code> su <code>120</code>. <a href='https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS'>Maggiori informazioni sugli header Cross-Origin Resource Sharing.</a>",
    "option_hiddenDotFiles_description": "Consente la visualizzazione e la lettura di file nascosti/con un punto. Questi sono file o cartelle con un nome che inizia con un <code>.</code>.",
    "option_upload_description": "Autorizza le richieste PUT/POST. Questo include file nascosti/con un punto se attivati.",
    "option_replace_description": "Se il caricamento di file è attivato, i file esistenti verranno sostituiti. Questo include file nascosti/con un punto se attivati.",
    "option_delete_description": "Autorizza le richieste DELETE. Questo include file nascosti/con un punto se attivati.",
    "option_staticDirectoryListing_description": "Disattiva l'ottimizzazione JavaScript degli elenchi delle cartelle.",
    "option_hiddenDotFilesDirectoryListing_description": "Se i file nascosti/con un punto sono attivati, questa opzione indica se verranno visualizzati nell'elenco presentato. Questo include i file <code>.swshtaccess</code>.",
    "option_precompression_description": "Cerca e trasmette versioni precompressionate dei file memorizzati nella stessa cartella, con lo stesso nome ma con estensione .gz o .br. Sono gestite le compressioni Gzip e/o Brotli. Ad esempio, se viene ricevuta una richiesta per <code>example.txt</code>, il server cercherà prima un <code>example.txt.gz</code> o <code>example.txt.br</code> e li trasmetterà se esistono e il client indica che può gestire questo metodo di compressione con l'intestazione <code>Accept-Encoding</code>.",
    "option_htaccess_description": "Puoi utilizzare file <code>.swshtaccess</code> per definire regole aggiuntive per cartella. Leggi <a href='https://simplewebserver.org/docs/swsaccess.html'>Configurazione avanzata utilizzando i file .swshtaccess</a>.<br><br>Questa funzionalità è sperimentale e potrebbe essere modificata nelle versioni future. Si consiglia di utilizzare i <a href='https://simplewebserver.org/docs/plugins.html'>plugin</a>.",
    "option_custom404_description": "Percorso di una pagina 404 personalizzata. Verrà utilizzata una pagina 404 generica se questo valore è vuoto o se è stato definito un percorso non valido.",
    "option_custom403_description": "Percorso di una pagina 403 personalizzata. Verrà utilizzata una pagina 403 generica se questo valore è vuoto o se è stato definito un percorso non valido.",
    "option_custom401_description": "Percorso di una pagina 401 personalizzata. Verrà utilizzata una pagina 401 generica se questo valore è vuoto o se è stato definito un percorso non valido.",
    "option_customErrorReplaceString_description": "Permette di definire una stringa personalizzata che verrà cercata nelle tue pagine di errore e verrà sostituita con il percorso attuale. Ad esempio, se la tua pagina 404 include: <code>Il file {{PATH}} non esiste</code> e inserisci <code>{{PATH}}</code> in questa opzione, quando la pagina viene restituita al client, conterrà <code>Il file /example.txt non esiste</code>.",
    "option_https_description": "Questa opzione rende accessibile il server tramite una connessione sicura (https) anziché http. Utilizza la stessa porta, quindi non è possibile utilizzare http e https contemporaneamente. Leggi <a href='https://simplewebserver.org/docs/https.html'>Utilizzo di HTTPS</a>.",
    "option_httpsCert_description": "È possibile impostare questa opzione se si desidera utilizzare un certificato HTTPS personalizzato. Leggi <a href='https://simplewebserver.org/docs/https.html'>Utilizzo di HTTPS</a>.",
    "option_httpsKey_description": "È possibile impostare questa opzione se si desidera utilizzare una chiave privata HTTPS personalizzata. Leggi <a href='https://simplewebserver.org/docs/https.html'>Utilizzo di HTTPS</a>.",
    "generate_crypto_overwrite_description": "Un certificato e una chiave privata esistono già. Questa azione li sovrascriverà.",
    "option_httpAuth_description": "Attiva un'autenticazione utilizzando un protocollo di autenticazione HTTP di base. Definisci un nome utente e una password nelle opzioni. Se manca una delle opzioni nome utente o password o se non è valido, il server web diventerà non accessibile.",
    "option_httpAuthUsername_description": "Nome utente per l'autenticazione HTTP di base. Non può contenere il carattere (<code>:</code>) o caratteri di controllo.",
    "httpAuthUsername_invalid": "Il nome utente non può contenere il carattere (<code>:</code>) o caratteri di controllo.",
    "httpAuthPassword_invalid": "La password non può contenere caratteri di controllo.",
    "option_httpAuthPassword_description": "Password per l'autenticazione HTTP di base. Viene memorizzato come testo normale. Non può contenere caratteri di controllo.",
    "option_ipThrottling_description": "Limita il numero di connessioni in ingresso per indirizzo IP. Usa 0 per connessioni illimitate.",
    "ipThrottling_invalid": "Inserisci un numero maggiore o uguale a 0",
    "update_available": "È disponibile una versione più recente di Simple Web Server",
    "no_servers": "Non hai ancora creato server",
    "error_port_in_use_description": "Il server web non è riuscito a partire perché la porta [PORT] è in uso da un altro programma.",
    "error_file_system": "Errore di accesso al disco",
    "error_plugins": "Errore all'avvio dei plugin",
    "error_generic": "Errore generico",
    "version": "Versione",
    "documentation": "Documentazione",
    "issues_and_suggestions": "Problemi e Suggerimenti",
    "web_server_url": "URL del server web",
    "ignore_update": "Ignora questo aggiornamento"
}